using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Tasks : MonoBehaviour
{
    // Start is called before the first frame update
    void Start()
    {
        
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}

// 1. Задержку спавна и задержку включения коллайдера +++++++++++++++++++++++++++++++++++++++++++
// 2. Контроллируемый спавн +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 3. Главное меню + Минимальные настройки
// 4. Проблема с дерганием коллайдеров
// 5. Окружение игровой сцены
// 6. Условия победы + Условия поражения ++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 7. Хранение рекорда 
// 8. Эффект мерджинга
// 9. Как быть если игрок собрал два финальных элемента